In [1]:
import pandas as pd

## Load/Create DataFrame

Read csv or excel file to import data. Create data frame programatically like this:

In [2]:
df = pd.DataFrame({'Artist': ['Billie Holiday', 'Jimi Hendrix', 'Miles Davis', 'SIA'],
                   'Genre': ['Jazz', 'Rock', 'Jazz', 'Pop'],
                   'Listeners': [1300000, 2700000, 1500000, 2000000],
                   'Plays': [27000000, 70000000, 48000000, 74000000]})

The variable df now contain a DataFrame. Executing thid shell shows the contents of the dataframe

In [3]:
df

           Artist Genre  Listeners     Plays
0  Billie Holiday  Jazz    1300000  27000000
1    Jimi Hendrix  Rock    2700000  70000000
2     Miles Davis  Jazz    1500000  48000000
3             SIA   Pop    2000000  74000000

## Selection
we can select any column using its label:

In [4]:
df['Artist']

0    Billie Holiday
1      Jimi Hendrix
2       Miles Davis
3               SIA
Name: Artist, dtype: object

We can select one or multiple rows using their numbers (inclusive of both bounding row numbers)

In [5]:
df.loc[1:3]

         Artist Genre  Listeners     Plays
1  Jimi Hendrix  Rock    2700000  70000000
2   Miles Davis  Jazz    1500000  48000000
3           SIA   Pop    2000000  74000000

In [8]:
# Exercie : Select only row #0
df.loc[:0]

           Artist Genre  Listeners     Plays
0  Billie Holiday  Jazz    1300000  27000000

We can select any slice of the table using a both column label and row numbers using loc:

In [9]:
df.loc[1:3,['Artist']]

         Artist
1  Jimi Hendrix
2   Miles Davis
3           SIA

In [10]:
# Exercise: Select 'Artist' and 'Plays' for rows #1 and #2
df.loc[2:4, ['Artist', 'Plays']]

        Artist     Plays
2  Miles Davis  48000000
3          SIA  74000000

## Filtering
We can easily filter rows using the values of a specific row. For example, here are our jazz musicians:

In [11]:
df[df['Genre'] == 'Jazz']

           Artist Genre  Listeners     Plays
0  Billie Holiday  Jazz    1300000  27000000
2     Miles Davis  Jazz    1500000  48000000

In [12]:
# Exercise: Select the row where the Genre is 'Rock'
df[df['Genre'] == 'Rock']

         Artist Genre  Listeners     Plays
1  Jimi Hendrix  Rock    2700000  70000000

Here are the artist who have more than 1,800,000 listeners:

In [14]:
df[df['Listeners'] > 1800000]

         Artist Genre  Listeners     Plays
1  Jimi Hendrix  Rock    2700000  70000000
3           SIA   Pop    2000000  74000000

In [16]:
# Exercise: Select the rows where 'Plays' is less than 50,000,000
df[df['Plays'] < 50000000]

           Artist Genre  Listeners     Plays
0  Billie Holiday  Jazz    1300000  27000000
2     Miles Davis  Jazz    1500000  48000000

## Grouping

In [18]:
df.groupby('Genre').sum()

                          Artist  Listeners     Plays
Genre
Jazz   Billie HolidayMiles Davis    2800000  75000000
Pop                          SIA    2000000  74000000
Rock                Jimi Hendrix    2700000  70000000

In [22]:
# Exercise : Group by Genre, use mean() as the aggregation function
by_genre = df.groupby('Genre')
by_genre.mean(numeric_only=True)

       Listeners       Plays
Genre
Jazz   1400000.0  37500000.0
Pop    2000000.0  74000000.0
Rock   2700000.0  70000000.0

In [23]:
# Exercise: Group by Genre, use max() as the aggregation function
by_genre.max(numeric_only=True)

       Listeners     Plays
Genre
Jazz     1500000  48000000
Pop      2000000  74000000
Rock     2700000  70000000